# OnShutdownEO Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationEntryPoint..::..OnShutdownEO Method
ApplicationEntryPoint Class See Also
---
For Revit Macros internal use only.
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void OnShutdownEO()
```

Visual Basic
---
```text
Public Sub OnShutdownEO
```

Visual C++
---
```text
public:
virtual void OnShutdownEO() sealed
```

# ### Implements
IEntryPoint..::..OnShutdown()()()()
# See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace